# Pandas Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series(np.arange(0,11,2))
s2 = pd.Series(np.arange(1,10,2))

In [4]:
print("s1 serie:\n{}\ns2 serie:\n{}".format(s1,s2))

s1 serie:
0     0
1     2
2     4
3     6
4     8
5    10
dtype: int64
s2 serie:
0    1
1    3
2    5
3    7
4    9
dtype: int64

In [5]:
s1+s2

0     1.0
1     5.0
2     9.0
3    13.0
4    17.0
5     NaN
dtype: float64

In [6]:
s2-s1

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
5    NaN
dtype: float64

In [7]:
s1*s2

0     0.0
1     6.0
2    20.0
3    42.0
4    72.0
5     NaN
dtype: float64

In [8]:
s2/s1

0         inf
1    1.500000
2    1.250000
3    1.166667
4    1.125000
5         NaN
dtype: float64

In [9]:
s1.eq(s2)

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [10]:
s3=s1.append(s2)
s3

0     0
1     2
2     4
3     6
4     8
5    10
0     1
1     3
2     5
3     7
4     9
dtype: int64

In [11]:
s1[:3]

0    0
1    2
2    4
dtype: int64

# Dataframe

In [12]:
# 6. Write a Pandas program to create and display a DataFrame from a specified
# dictionary data which has the index labels

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily','Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}



df = pd.DataFrame(exam_data, index=labels)
df.head()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no

In [13]:
# 7. Write a Pandas program to get 
# the first 3 rows of a given DataFrame.
df[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [14]:
# 8. Write a Pandas program to select the rows 
# where the score is missing, i.e.is NaN.
df[df['score'].isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [15]:
# 9. Write a Pandas program to select 
# the rows where number of attempts in the
# examination is less than 2 and score greater than 15.

df[(df['attempts']<2)&(df['score']>15)]

#ou df.loc[(df['attempts']<2)&(df['score']>15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [16]:
# 10. Write a Pandas program to change 
# the score in row 'd' to 11.5.
df.loc['d','score']=1

In [17]:
# 11. Write a Pandas program to replace the ‘qualify' column 
# contains the values 'yes' and 'no' with True and False.

df['qualify']=(df['qualify']=='yes')
#df.replace({"yes" : True, "no" : False})
#df['qualify']=df['qualify'].map({"yes" : True, "no" : False})
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    1.0         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [18]:
# 13. Write a Pandas program to delete the 'attempts' column 
# from the DataFrame.

df.drop('attempts',axis=1)

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d      James    1.0    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True

In [19]:
# 14. Write a Pandas program to 
# insert a new column in existing DataFrame.
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']

df['color']=color
df

        name  score  attempts  qualify   color
a  Anastasia   12.5         1     True     Red
b       Dima    9.0         3    False    Blue
c  Katherine   16.5         2     True  Orange
d      James    1.0         3    False     Red
e      Emily    9.0         2    False   White
f    Michael   20.0         3     True   White
g    Matthew   14.5         1     True    Blue
h      Laura    NaN         1    False   Green
i      Kevin    8.0         2    False   Green
j      Jonas   19.0         1     True     Red

In [22]:
# 15. Write a Pandas program to 
# rename columns of a given DataFrame.

df = pd.DataFrame(data=[[1,4,7],[2,5,8],[3,6,9]], columns=["col1","col2","col3"])

df.columns = ['column1','column2','column3']
#df = df.rename(columns={"col1":"column 1","col2":"column 2","col3":"column 3"})

df

   column1  column2  column3
0        1        4        7
1        2        5        8
2        3        6        9